#+SETUPFILE: ~/.emacs.d/org-templates/template.org
#+TITLE: Numpy

* 数据类型
| Numpy Type                  | C Type              |
|-----------------------------+---------------------|
| np.bool_                    | bool                |
| np.byte                     | signed char         |
| np.ubyte                    | unsigned char       |
| np.short                    | short               |
| np.ushort                   | unsigned short      |
| np.intc                     | int                 |
| np.uintc                    | unsigned int        |
| np.int_                     | long                |
| np.uint                     | unsigned long       |
| np.longlong                 | long long           |
| np.ulonglong                | unsigned long long  |
| np.half / np.float16        |                     |
| np.single                   | float               |
| np.double                   | double              |
| np.longdouble               | long double         |
| np.csingle                  | float complex       |
| np.cdouble                  | double complex      |
| np.clongdouble              | long double complex |
| np.int8                     | int8_t              |
| np.int16                    | int16_t             |
| np.int32                    | int32_t             |
| np.int64                    | int64_t             |
| np.uint8                    | uint8_t             |
| np.uint16                   | uint16_t            |
| np.uint32                   | uint32_t            |
| np.uint64                   | uint64_t            |
| np.intp                     | intptr_t            |
| np.uintp                    | uintptr_t           |
| np.float32                  | float               |
| np.float64 / np.float_      | double              |
| np.complex64                | float complex       |
| np.complex128 / np.complex_ | double complex      |
* 创建数组
#+NAME: import-np
#+BEGIN_SRC python :results silent
  import numpy as np
#+END_SRC
** 把python原有的数组转变成numpy的数组
#+BEGIN_VERSE
np.array(array)
#+END_VERSE
** numpy提供的一些函数
1. zero(shape, dtype=np.float64): 元素的默认类型为 float64
   #+BEGIN_SRC python :results pp :noweb strip-export
     <<import-np>>
     return np.zeros((2,3), dtype=np.int32)
   #+END_SRC

   #+RESULTS:
   : array([[0, 0, 0],
   :        [0, 0, 0]], dtype=int32)
2. zero(shape, dtype=np.float(64))
   #+BEGIN_SRC python :results pp :noweb strip-export
     <<import-np>>
     return np.ones((3, 3), dtype=np.int32)
   #+END_SRC

   #+RESULTS:
   : array([[1, 1, 1],
   :        [1, 1, 1],
   :        [1, 1, 1]], dtype=int32)
3. range(start, end, step, dtype=np.float64)
   #+BEGIN_SRC python :results pp :noweb strip-export
     <<import-np>>
     a = np.arange(10)
     b = np.arange(2, 10, dtype=np.int32)
     c = np.arange(2, 3, 0.1)
     return a, b, c
   #+END_SRC

   #+RESULTS:
   : (array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9]),
   :  array([2, 3, 4, 5, 6, 7, 8, 9], dtype=int32),
   :  array([2. , 2.1, 2.2, 2.3, 2.4, 2.5, 2.6, 2.7, 2.8, 2.9]))
4. linspace(start, stop, num=50, endpoint=True, retstep=False, dtype=None, axis=0)
   #+BEGIN_VERSE
   1. 返回从start开始,stop结束,num个元素.start,stop也可以是数组
   2. endpoint为True则stop也会包括在返回的数组中
   3. retstep为True则把step也返回
   4. axis表示返回的数组的维度,默认为0表示返回的是1维数组.start,stop为n维时,axis最大为n-1
   #+END_VERSE
   #+BEGIN_SRC python :results pp :noweb strip-export
     <<import-np>>
     return np.linspace((1, 2), (2, 10), 6, retstep=True, dtype=np.int32)
   #+END_SRC

   #+RESULTS:
   : (array([[ 1,  2],
   :        [ 1,  3],
   :        [ 1,  5],
   :        [ 1,  6],
   :        [ 1,  8],
   :        [ 2, 10]], dtype=int32),
   :  array([0.2, 1.6]))
5. indices(dimensions, dtype=<class 'int'>, sparse=False)
   #+BEGIN_VERSE
   创建一堆数组.一共有len(dimensions)+1维.每个数字表示每个维度的最大值
   #+END_VERSE
   #+BEGIN_SRC python :results pp :noweb strip-export
     <<import-np>>
     return np.indices((2,))
   #+END_SRC

   #+RESULTS:
   : array([[0, 1]])
